---
kind: other
id: Properties.T:Autodesk.Revit.UI.TextEditorOptions
source: html/ba94bc48-f5f0-70ac-feca-30c4082bd3e7.htm
---
# TextEditorOptions Properties

Specifies whether the .NET object represents a valid Revit entity.